const matchUrlAndName = iconName => {   // 图片名称及对应的地址
  let nameArr = [
    // 第一页
    '[微笑]', '[撇嘴]', '[色]', '[吃惊]', '[酷]', '[哭]', '[害羞]', '[闭嘴]', '[睡觉]',
    '[大哭]', '[尴尬]', '[大火]', '[吐舌头]', '[大笑]', '[惊讶]', '[难过]', '[得意]', '[汗]',
    '[抓狂]', '[呕吐]', '[偷笑]', '[可爱]', '[白眼]', '[撇嘴]', '[馋]', '[困]', '[惊恐]',
    '[无语]', '[憨笑]', '[大兵]', '[奋斗]', '[咒骂]', '[疑问]', '[嘘]', '[眩晕]', '[挣扎]',
    '[懵]', '[骷髅]', '[砸头]', '[再见]', '[擦汗]', '[抠鼻]', '[鼓掌]', '[出丑]', '[坏笑]',
    // 第二页
    '[左哼哼]', '[右哼哼]', '[打哈气]', '[鄙视]', '[委屈]', '[快哭了]', '[阴险]', '[亲亲]', '[吓]',
    '[可怜]', '[菜刀]', '[西瓜]', '[啤酒]', '[篮球]', '[乒乓]', '[咖啡]', '[米饭]', '[猪头]',
    '[鲜花]', '[枯萎]', '[嘴唇]', '[爱心]', '[心碎]', '[生日]', '[闪电]', '[地雷]', '[刀]',
    '[足球]', '[瓢虫]', '[屎]', '[月亮]', '[太阳]', '[礼物]', '[抱抱]', '[赞]', '[踩]',
    '[握手]', '[耶]', '[抱拳]', '[勾引]', '[拳头]', '[小拇指]', '[爱你]', '[no]', '[ok]',
    // 第三页
    '[爱情]', '[飞吻]', '[兴奋]', '[发抖]', '[叫]', '[旋转]', '[鞠躬]', '[回头]', '[跳]',
    '[挥手]', '[激动]', '[街舞]', '[献吻]', '[右太极]', '[左太极]',
  ];
  let idx = nameArr.findIndex(item => item === iconName);
  return `http://115.182.62.190:8077/js/kindeditor/plugins/emoticons/images/${idx}.gif`;
}

export default {
  matchUrlAndName
}
